In [1]:
import pandas as pd

In [2]:
raw = pd.read_csv("rooms.csv")

In [3]:
rooms = raw.rename({" floor":"floor"," capacity":"capacity"}, axis="columns")

In [5]:
rooms[["room","capacity"]]

  room  capacity
0   S3       116
1   S5       118
2   S9       118
3   S4        70
4   S8        30
5   S1        40
6   S6        24
7   S7        24
8  S10        24
9  S11        24

In [6]:
grouped = rooms.groupby(rooms["floor"]).agg({"capacity":"sum","room":"count"})
grouped.head()

       capacity  room
floor
1           196     4
2           166     3
3           186     2
4            40     1

In [7]:
grouped = rooms.groupby(rooms["floor"]).agg(capacity=("capacity","sum"),count=("room","count"))
grouped.head()

       capacity  count
floor
1           196      4
2           166      3
3           186      2
4            40      1

In [8]:
indexed = rooms.set_index("room")

In [9]:
indexed.loc["S5","capacity"]

118

In [10]:
melted = rooms.melt(id_vars=["room"],var_name="feature")
melted.head()

  room feature  value
0   S3   floor      3
1   S5   floor      2
2   S9   floor      1
3   S4   floor      3
4   S8   floor      1

In [11]:
pivoted = melted.pivot(index="room",columns="feature",values="value")
pivoted.head()

feature  capacity  floor
room
S1             40      4
S10            24      1
S11            24      1
S3            116      3
S4             70      3

In [12]:
pivoted["capacity"]

room
S1      40
S10     24
S11     24
S3     116
S4      70
S5     118
S6      24
S7      24
S8      30
S9     118
Name: capacity, dtype: int64